package ru.kolts.java.basic.homework10.lesson16.collections;
/**
 * Реализуйте класс PhoneBook, который хранит в себе список имен (фио) и телефонных номеров;<p>
 * Метод add() должен позволять добавлять запись имя-телефон;<p>
 * Метод find() выполнять поиск номер(-а, -ов) телефона по имени;<p>
 * Под одним именем может быть несколько телефонов (в случае однофамильцев, или наличии у одного человека
 * нескольких номеров), тогда при запросе такой фамилии должны выводиться все телефоны;<p>
 * Метод containsPhoneNumber должен проверять наличие телефона в справочнике.
 */
public class MainApp {
    public static void main(String[] args) {

    }
}
